<a href="https://colab.research.google.com/github/sprabhala-cpu/basics/blob/main/working_with_date_time_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
data=pd.read_csv('/content/quakes.csv')

In [8]:
data.head(5)
data['time'].dtype

dtype('O')

In [9]:
#convert strings to datetime
data['time']=pd.to_datetime(data['time'])
#to_datetime is able to parse any valid date string to date time

In [ ]:
data.info()

In [11]:
data.head(5)#by deafult datetime parse string with month first and day later
#format is mm/dd or mmdd or mm-dd

                              time  latitude  ...  locationSource  magSource
0 2004-01-01 00:03:08.950000+00:00   -24.582  ...              us         us
1 2004-01-01 01:41:50.700000+00:00    47.034  ...              us        hrv
2 2004-01-01 03:15:21.140000+00:00    23.315  ...              us        hrv
3 2004-01-01 04:39:12.150000+00:00   -21.476  ...              us        hrv
4 2004-01-01 05:59:01.120000+00:00    46.999  ...              us        hrv

[5 rows x 22 columns]

In [14]:
#some places they stored data in the format of dd-mm
#we can specify with date first argument 
data['time']=pd.to_datetime(data['time'],dayfirst=True)

In [18]:
#yyyy-dd-mm h:m:s 
df = pd.DataFrame({'date': ['2016-6-10 20:30:0', 
                            '2016-7-1 19:45:30', 
                            '2016-10-12 4:5:1'],
                   'value': [2, 3, 4]})

In [22]:
df['date']=pd.to_datetime(df['date'],format='%Y-%d-%m %H:%M:%S')

In [28]:
df.drop('data',axis=1,inplace=True)

In [29]:
df

                 date  value
0 2016-10-06 20:30:00      2
1 2016-01-07 19:45:30      3
2 2016-12-10 04:05:01      4

In [35]:
#spped up parsing with infer_datetime_format
df=pd.DataFrame({'date':['3/11/2000', '3/12/2000', '3/13/2000']*1000})

In [36]:
%timeit pd.to_datetime(df['date'],infer_datetime_format=True)

The slowest run took 7.48 times longer than the fastest. This could mean that an intermediate result is being cached.
1000 loops, best of 5: 1.62 ms per loop

In [62]:
#handling parsing erros

df = pd.DataFrame({'date': ['2016-6-10 20:30:0', 
                            '2016-7-1 19:30:5', 
                            'a-10-12 4:5:1'],
                   'value': [2, 3, 4]})

In [63]:
df['date']=pd.to_datetime(df['date'],errors='coerce')

In [64]:
df

                 date  value
0 2016-06-10 20:30:00      2
1 2016-07-01 19:30:05      3
2                 NaT      4

In [57]:
df = pd.DataFrame({'date': ['3/10/2000', 'a/11/2000', '3/12/2000'],
                   'value': [2, 3, 4]})
df['date'] = pd.to_datetime(df['date'],errors='coerce')

In [59]:
df

        date  value
0 2000-03-10      2
1        NaT      3
2 2000-03-12      4

In [65]:
#pd.read_csv( parse_dates=)this can be used also

In [74]:
#assemble a date time from multiple columns
df=pd.DataFrame({'year':[2028,2029],
                 'day':[3,4],
                 'month':[2,3]})

In [75]:
df['date']=pd.to_datetime(df)

In [76]:
df

   year  day  month       date
0  2028    3      2 2028-02-03
1  2029    4      3 2029-03-04

In [77]:
#get year,monthand day
'''dt.year,dt.month,dt.day are inbuilt attributrs to get year,month and day
frp, datetime object'''

'dt.year,dt.month,dt.day are inbuilt attributrs to get year,month and day\nfrp, datetime object'

In [78]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   year    2 non-null      int64
 1   day     2 non-null      int64
 2   month   2 non-null      int64
 3   date    2 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int64(3)
memory usage: 192.0 bytes

In [82]:
df = pd.DataFrame({'name': ['Tom', 'Andy', 'Lucas'],
                 'DoB': ['08-05-1997', '04-28-1996', '12-16-1995']})
df['DoB'] = pd.to_datetime(df['DoB'])

In [84]:
df['year']=df['DoB'].dt.year
df['month']=df['DoB'].dt.month
df['day']=df['DoB'].dt.day

In [85]:
df

    name        DoB  year  month  day
0    Tom 1997-08-05  1997      8    5
1   Andy 1996-04-28  1996      4   28
2  Lucas 1995-12-16  1995     12   16

In [86]:
#get week of year, the day of week and leap year
#similary dt.week,dt.dayofweek and dt.is_leap_year

In [91]:
df['week']=df['DoB'].dt.week
df['day_of_week']=df['DoB'].dt.dayofweek
df['leapyear']=df['DoB'].dt.is_leap_year

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated.  Please use Series.dt.isocalendar().week instead.
  """Entry point for launching an IPython kernel.

In [92]:
df

    name        DoB  year  month  day  week  day_of_week  leapyear
0    Tom 1997-08-05  1997      8    5    32            1     False
1   Andy 1996-04-28  1996      4   28    17            6      True
2  Lucas 1995-12-16  1995     12   16    50            5     False

In [93]:
'''not the pandas dt.dayofweek starts at 0 monday and ends at 6 sunday'''
#create a mapping
dw_mapping={
    0:'Monday',
    1:'tuesday',
    2:'wednesday',
    3:'thursday',
    4:'friday',
    5:'saturday',
    6:'sunday'
}

In [94]:
df['day_of_week']=df['DoB'].dt.dayofweek.map(dw_mapping)

In [95]:
df

    name        DoB  year  month  day  week day_of_week  leapyear
0    Tom 1997-08-05  1997      8    5    32     tuesday     False
1   Andy 1996-04-28  1996      4   28    17      sunday      True
2  Lucas 1995-12-16  1995     12   16    50    saturday     False

In [98]:
today=pd.to_datetime('today')

In [99]:
today

Timestamp('2021-05-13 09:48:18.780730')

In [100]:
df['age']=today.year-df['DoB'].dt.year

In [101]:
df

    name        DoB  year  month  day  week day_of_week  leapyear  age
0    Tom 1997-08-05  1997      8    5    32     tuesday     False   24
1   Andy 1996-04-28  1996      4   28    17      sunday      True   25
2  Lucas 1995-12-16  1995     12   16    50    saturday     False   26

In [102]:
b_md = df['DoB'].apply(lambda x: (x.month,x.day) )

In [103]:
b_md

0      (8, 5)
1     (4, 28)
2    (12, 16)
Name: DoB, dtype: object

In [104]:
no_birthday = b_md > (today.month,today.day)

In [105]:
no_birthday

0     True
1    False
2     True
Name: DoB, dtype: bool

In [107]:
#improve performance by setting datetime as index
#most of the time we select dates
'''
condition=df['date']>start_date & df['date]<end_date
df.loc[condition]'''

"\ncondition=df['date']>start_date & df['date]<end_date\ndf.loc[condition]"

In [ ]:
#instead we can make use of index for optimization
'''df=df.set_index['date']
selectiong specific year
df.loc['2018]

In [112]:
data.set_index('time',inplace=True)

In [111]:
data

                                  time  latitude  ...  locationSource  magSource
0     2004-01-01 00:03:08.950000+00:00   -24.582  ...              us         us
1     2004-01-01 01:41:50.700000+00:00    47.034  ...              us        hrv
2     2004-01-01 03:15:21.140000+00:00    23.315  ...              us        hrv
3     2004-01-01 04:39:12.150000+00:00   -21.476  ...              us        hrv
4     2004-01-01 05:59:01.120000+00:00    46.999  ...              us        hrv
...                                ...       ...  ...             ...        ...
28402 2007-12-31 17:07:21.010000+00:00   -24.327  ...              us         us
28403 2007-12-31 18:23:36.490000+00:00    41.113  ...              us       gcmt
28404 2007-12-31 19:26:26.190000+00:00    41.116  ...              us         us
28405 2007-12-31 22:00:29.350000+00:00    13.698  ...              us       gcmt
28406 2007-12-31 23:43:14.100000+00:00   -25.848  ...              us         us

[28407 rows x 22 columns]

In [113]:
data.head(5)

                                  latitude  longitude  ...  locationSource  magSource
time                                                   ...
2004-01-01 00:03:08.950000+00:00   -24.582   -179.970  ...              us         us
2004-01-01 01:41:50.700000+00:00    47.034    154.071  ...              us        hrv
2004-01-01 03:15:21.140000+00:00    23.315    121.613  ...              us        hrv
2004-01-01 04:39:12.150000+00:00   -21.476    169.859  ...              us        hrv
2004-01-01 05:59:01.120000+00:00    46.999    154.188  ...              us        hrv

[5 rows x 21 columns]

In [123]:
df=data[['depth']]

In [125]:
df['3-moving-average']=df['depth'].rolling(3).sum()

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [127]:
df.head(5)

                                  depth  3-moving-average
time
2004-01-01 00:03:08.950000+00:00  488.9               NaN
2004-01-01 01:41:50.700000+00:00   40.0               NaN
2004-01-01 03:15:21.140000+00:00   54.5             583.4
2004-01-01 04:39:12.150000+00:00   10.0             104.5
2004-01-01 05:59:01.120000+00:00   44.9             109.4

In [133]:
df['no_na']=df['3-moving-average'].fillna(method='bfill' )

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [134]:
df

                                  depth  3-moving-average  no_na
time
2004-01-01 00:03:08.950000+00:00  488.9               NaN  583.4
2004-01-01 01:41:50.700000+00:00   40.0               NaN  583.4
2004-01-01 03:15:21.140000+00:00   54.5             583.4  583.4
2004-01-01 04:39:12.150000+00:00   10.0             104.5  104.5
2004-01-01 05:59:01.120000+00:00   44.9             109.4  109.4
...                                 ...               ...    ...
2007-12-31 17:07:21.010000+00:00  509.0             934.8  934.8
2007-12-31 18:23:36.490000+00:00   17.2             892.2  892.2
2007-12-31 19:26:26.190000+00:00   17.3             543.5  543.5
2007-12-31 22:00:29.350000+00:00   65.7             100.2  100.2
2007-12-31 23:43:14.100000+00:00  491.9             574.9  574.9

[28407 rows x 3 columns]